#+TITLE: awesome smoking
#+AUTHOR: Qun Wang <tshwangq@gmail.com>

* awesome-smoking
manage my smoking/non-smoking life in org-mode

** tech stack

- emacs
- org-mode + org-habit + org-todo
- magit
- pomodoro
- 乐只app

** updates logs
- 我开始用orgmode + git 来管理我的香烟人生了。先订个小目标把抽烟(🚬)版本化，再考虑戒烟(🚭). for details, please check smoking.org

- 调整readme

- [2016-11-10] 想不到已经作为非吸烟者９６个小时了．目前来看，版本化策略非常成功，给我足够的时间思考和探索有哪些戒烟的方法． 也给了足够的过渡时间


* DONE awesome smoking                                              :smoking:
  SCHEDULED: <2016-10-26 三>
  :PROPERTIES:
  :STYLE:    habit
  :LOGGING: TODO(!) WAIT(!) DONE(!) CANCELED(!)
  :LAST_REPEAT: [2016-10-13 四 16:36]
  :END:
  - State "DONE"       from "TODO"       [2016-11-09 三 16:51]
  - State "TODO"       from "DONE"       [2016-10-21 五 20:39]
  - State "TODO"       from "DONE"       [2016-10-21 五 19:33]
  - State "TODO"       from "DONE"       [2016-10-21 五 18:33]
  - State "TODO"       from "DONE"       [2016-10-21 五 17:38]
  - State "TODO"       from "DONE"       [2016-10-21 五 15:32]
  - State "TODO"       from "DONE"       [2016-10-21 五 14:50]
  - State "TODO"       from "DONE"       [2016-10-21 五 12:25]
  - State "TODO"       from "DONE"       [2016-10-21 五 11:43]
  - State "TODO"       from "DONE"       [2016-10-21 五 10:43]
  - State "TODO"       from "DONE"       [2016-10-21 五 10:13]
  - State "TODO"       from "DONE"       [2016-10-18 二 12:39]
  - State "TODO"       from "DONE"       [2016-10-18 二 12:00]
  - State "TODO"       from "DONE"       [2016-10-18 二 11:00]
  - State "TODO"       from "DONE"       [2016-10-18 二 10:10]
  - State "TODO"       from "DONE"       [2016-10-18 二 09:00]
  - State "TODO"       from "DONE"       [2016-10-18 二 08:20]
  - State "TODO"       from "DONE"       [2016-10-17 一 13:28]
  - State "TODO"       from "DONE"       [2016-10-17 一 12:28]
  - State "TODO"       from "DONE"       [2016-10-17 一 11:28]
  - State "TODO"       from "DONE"       [2016-10-17 一 09:10]
  - State "TODO"       from "DONE"       [2016-10-17 一 08:30]
  - State "TODO"       from "DONE"       [2016-10-16 日 11:53]
  - State "TODO"       from "DONE"       [2016-10-16 日 10:53]
  - State "TODO"       from "DONE"       [2016-10-16 日 09:53]
  - State "TODO"       from "DONE"       [2016-10-16 日 08:53]
  - State "TODO"       from "DONE"       [2016-10-16 日 08:23]
  - State "TODO"       from "DONE"       [2016-10-15 六 17:37]
  - State "TODO"       from "DONE"       [2016-10-15 六 15:07]
  - State "TODO"       from "DONE"       [2016-10-15 六 12:03]
  - State "TODO"       from "DONE"       [2016-10-15 六 11:00]
  - State "TODO"       from "DONE"       [2016-10-15 六 09:44]
  - State "TODO"       from "DONE"       [2016-10-15 六 08:40]
  - State "TODO"       from "DONE"       [2016-10-14 五 21:11]
    way home
  - State "TODO"       from "DONE"       [2016-10-14 五 18:52]
    饭后一根烟呀
  - State "TODO"       from "DONE"       [2016-10-14 五 17:18]
  - State "TODO"       from "DONE"       [2016-10-14 五 15:34]
      犯困抽一根
  - State "TODO"       from "DONE"       [2016-10-14 五 14:43]
  - State "TODO"       from "DONE"       [2016-10-14 五 13:08]
  - State "TODO"       from "DONE"       [2016-10-14 五 10:13]
  - State "TODO"       from "DONE"       [2016-10-14 五 09:23]
  - State "TODO"       from "DONE"       [2016-10-13 四 22:13]
  - State "TODO"       from "DONE"       [2016-10-13 四 20:53]
  - State "TODO"       from "DONE"       [2016-10-13 四 19:03]
  :LOGBOOK:
  CLOCK: [2016-10-13 四 20:48]--[2016-10-13 四 20:53] =>  0:05
  CLOCK: [2016-10-13 四 18:58]--[2016-10-13 四 19:03] =>  0:05
  CLOCK: [2016-10-13 四 17:39]--[2016-10-13 四 17:45] =>  0:06
  :END:
  - State "TODO"       from "DONE"       [2016-10-13 四 16:37]
    awesome
  - State "TODO"       from "DONE"       [2016-10-13 四 17:45]


* DONE read 这书能让你戒烟<The Easy Way to Stop Smoking>
  CLOSED: [2016-10-31 一 19:53] SCHEDULED: <2016-10-28 五 +1d>
  - CLOSING NOTE [2016-10-31 一 19:53]
  开始阅读本书

* Stop Smoking Benefits Timetable
Within ...

- 20 minutes - Your blood pressure, pulse rate and the temperature of your hands and feet have returned to normal.
- 8 hours - Remaining nicotine in your bloodstream will have fallen to 6.25% of normal peak daily levels, a 93.75% reduction.
- 12 hours - Your blood oxygen level will have increased to normal and carbon monoxide levels will have dropped to normal.
- 24 hours - Anxieties have peaked in intensity and within two weeks should return to near pre-cessation levels.
- 48 hours - Damaged nerve endings have started to regrow and your sense of smell and taste are beginning to return to normal. Cessation anger and irritability will have peaked.
- 72 hours - Your entire body will test 100% nicotine-free and over 90% of all nicotine metabolites (the chemicals it breaks down into) will now have passed from your body via your urine.  Symptoms of chemical withdrawal have peaked in intensity, including restlessness. The number of cue induced crave episodes experienced during any quitting day will peak for the "average" ex-user. Lung bronchial tubes leading to air sacs (alveoli) are beginning to relax in recovering smokers. Breathing is becoming easier and the lung's functional abilities are starting to increase.
- 5 - 8 days - The "average" ex-smoker will encounter an "average" of three cue induced crave episodes per day. Although we may not be "average" and although serious cessation time distortion can make minutes feel like hours, it is unlikely that any single episode will last longer than 3 minutes. Keep a clock handy and time them.
- 10 days - 10 days - The "average" ex-user is down to encountering less than two crave episodes per day, each less than 3 minutes.
- 10 days to 2 weeks - Recovery has likely progressed to the point where your addiction is no longer doing the talking. Blood circulation in your gums and teeth are now similar to that of a non-user.
- 2 to 4 weeks - Cessation related anger, anxiety, difficulty concentrating, impatience, insomnia, restlessness and depression have ended. If still experiencing any of these symptoms get seen and evaluated by your physician.
- 21 days - Brain acetylcholine receptor counts that were up-regulated in response to nicotine's presence have now down-regulated and receptor binding has returned to levels seen in the brains of non-smokers.
- 2 weeks to 3 months - Your heart attack risk has started to drop. Your lung function is beginning to improve.
- 3 weeks to 3 months - Your circulation has substantially improved. Walking has become easier. Your chronic cough, if any, has likely disappeared. If not, get seen by a doctor, and sooner if at all concerned, as a chronic cough can be a sign of lung cancer.
- 8 weeks - Insulin resistance in smokers has normalized despite average weight gain of 2.7 kg (1997 study).
- 1 to 9 months - Any smoking related sinus congestion, fatigue or shortness of breath have decreased. Cilia have regrown in your lungs, thereby increasing their ability to handle mucus, keep your lungs clean and reduce infections. Your body's overall energy has increased.
- 1 year - Your excess risk of coronary heart disease, heart attack and stroke have dropped to less than half that of a smoker.
- 5 years - Your risk of a subarachnoid haemorrhage has declined to 59% of your risk while still smoking (2012 study). If a female ex-smoker, your risk of developing diabetes is now that of a non-smoker (2001 study).
- 5 to 15 years - Your risk of stroke has declined to that of a non-smoker.
- 10 years - Your risk of being diagnosed with lung cancer is between 30% and 50% of that for a continuing smoker (2005 study). Risk of death from lung cancer has declined by almost half if you were an average smoker (one pack per day).  Risk of cancer of the mouth, throat, esophagus and pancreas have declined. Risk of developing diabetes for both men and women is now similar to that of a never-smoker (2001 study and 2012 study).
- 13 years - The average smoker able to live to age 75 has 5.8 fewer teeth than a non-smoker (1998 study). But by year 13 after quitting, your risk of smoking induced tooth loss has declined to that of a never-smoker (2006 study).
- 15 years - Your risk of coronary heart disease is now that of a person who has never smoked. Your risk of pancreatic cancer has declined to that of a never-smoker (2011 study - but note 2nd pancreatic making identical finding at 20 years).
- 20 years - Female excess risk of death from all smoking related causes, including lung disease and cancer, has now reduced to that of a never-smoker (2008 study). Risk of pancreatic cancer reduced to that of a never-smoker (2011 study).

* 戒烟综合症
** 失眠
*** no coffee
*** 洗个热水澡
*** 花草茶
*** 热牛奶


* count

|        day | total |
|------------+-------|
| 2016-10-13 |    10 |
| 2016-10-14 |     8 |
| 2016-10-15 |    12 |
| 2016-10-16 |    15 |
| 2016-10-17 |    18 |
| 2016-10-18 |    17 |
| 2016-10-19 |    15 |
| 2016-10-19 |    18 |
|            |       |

* notes
** 周末不在电脑面前，没有有效追踪，吸烟量上升
** http://zh.wikihow.com/%E5%BF%AB%E9%80%9F%E6%88%92%E7%83%9F

* research

总有不止一个时刻，你认真地想过要戒烟。

** why so hard?
吸烟的原理
*** it's a double trick
抽烟是一个双重把戏。 你永远无法叫醒一个装睡的人，原因就在于你就是那个装睡的人。
**** Prestige
Prestige致命魔术告诉我们一个优秀的魔术分三步：
- 以虚代实 The Pledge，
- 偷天换日 The Turn，
- 化腐朽为神奇 The Prestige，
抽烟就是这样一个具有Prestige的魔术。

抽烟带给你的愉悦实际是个假象，你把制造痛苦再缓解痛苦当成了愉悦。
人的大脑通常对已发生的行为进行正向的合理化，
所以无论抽烟那一刻你有多痛苦，但最终大脑认为抽烟给你带来了愉悦。
没有人知道你为抽烟付出了多少痛苦。
Sacrifice牺牲, Obsession执念, 然后才有致命魔术的Prestige.

**** The Second Trick: Inception 第二重：盗梦空间

但Prestige这个虚假的Trick总会容易拆穿，
至少置疑，你咳嗽、干呕、失眠怎么能体会不到其中的痛苦？
但你为什么不愿意拆穿，因为你根本不知道如何拆穿。

***** Smoke is a high level inception。
抽烟就是这样一种高层植入，当尼古丁遇到多巴胺，你就知道你有多泥足深陷。

- 人类的社会化渐渐将及时满足转化为追求奖励，因此让人产生原始动力的多巴胺和奖励结合在了一起。


如果你不幸在第一个trick之下把抽烟当成一种愉悦，这种虚假的愉悦就变成一种奖励，随之而来就是多巴胺的产生，建立了尼古丁和多巴胺的关联；
而多巴胺和各种奖励关联，也就意味着尼古丁和各种奖励的关联。
所以抽烟就像巴普洛夫狗实验中的口水一样，奖励就是刺激铃声，多巴胺就是进食，长时间的培养必然会造成奖励和抽烟之间的条件反射。
这样你就可以更好地理解”饭后一支烟，赛似活神仙“了，因为你已经止不住口水的流下了。

抽烟==虚假愉悦 ==奖励
奖励==多巴胺
多巴胺==各种奖励
各种奖励-->抽烟


当我们再谈烟瘾，实际上烟瘾还是种心智模式成瘾，它和你的日常生活绑定在了一起，It's a high level inception, you have to go deeper. 戒烟，你需要走向更深处。

** how?
*** 为什么说减量法和纯意志法无效？
**** 减量法：
    尼古丁代谢速度之快，一根足已重新成瘾。虚假的愉悦一旦形成，紧接着就是连锁反应。所以戒烟不同于常规的习惯培养。

**** 纯意志法:
    意志在戒烟过程中不可或缺，但有志者≠事竟成。"willpower is like muscle"，这是我看过最形象的意志力比喻了，意志就像是肌肉：
    - 意志可以像肌肉一样通过锻炼获得增长；
    - 意志会像肌肉一样在承重之下会渐渐耗尽。
     你再想象下前文提到的如鲠在喉的感觉，虽然不痛，但不舒服，慢慢消耗你的肌肉。你忍得了一个小时，但一觉醒来依然还在的话你是否还能继续忍耐？
    当你渐渐失去耐心的时候你会怎么做？吞饭、吞醋、惊吓，总之各种方法你都会尝试，你一刻无法再忍耐。所以，意志总有消耗完的一刻。

*** How to make a Switch 如何转变
   “Switch-How to Change Things When Change is Hard”，这是我非常喜爱的一本书。
   人生的过程实际上是大象（Elepant）与骑象人(Rider)走在路上(Environment)，象代表你的感性，骑象人代表你的理性。
   所以戒烟也是面对同样的三个部分：
   - 明确的方向和计划Direct the Rider,
   - 激励大象Motivate the Elepant,
   - 优化环境Shape the Path


*** 当我们意识到戒烟的过程主要面对的是尼古丁成瘾和心智模式成瘾后，我们再来看看契机有哪些。
尼古丁代谢速度快是其戒断反应强烈的原因，同时也意味着人体彻底代谢完尼古丁也很快。
通常一周时间尼古丁就能从身体彻底代谢完，所以第一周主要在克服戒断反应，尤以前三天最强烈。
而心智模式实际是人的习惯，我们常说21天就可以改变一个习惯。所以整个戒断过程分为生理戒断和心理戒断。

**** 所以针对整个过程所遇到的不同门槛，采取不同的对策，建议整个过程分为三个阶段：

- 第一道槛，前三天，强烈的戒断反应；建议 创造一个强烈的初始契机，如生病，恐惧，愤怒等，营造强烈的动机，靠激情撑过前三天；
- 第二道槛，第一周，尼古丁代谢殆尽；建议在家人的陪伴下度过，尽可能减少复杂事务的处理，远离吸烟人群，让自己保持在舒适的状态下，靠改变环境克服第一周；
- 第三道槛，前三周，心智模式成瘾；建议充分了解烟瘾原理，锻炼自我觉察，守护潜意识，抑制冲动，靠守护心智度过前三周；

其后在生理戒断反应逐渐消除的情况下，通过持续不同的自我觉察配合身体锻炼所带来的意志力增强，避免大的情绪波动，培养健康的心智模式替换旧的心智模式，实现心理戒断就会越来越轻松。


** tip
*** 戒烟贴
*** Mind Chi
*** Self-awareness
*** Meditation
*** 这本书可以让你戒烟
*** 旅行
*** Willpower
- 跑步


** 抽烟场景

* phase I
** DONE 记录吸烟
   CLOSED: [2016-10-28 五 13:39]
   - CLOSING NOTE [2016-10-28 五 13:39]
** DONE 探索戒烟方法
   CLOSED: [2016-10-28 五 13:39]
   - CLOSING NOTE [2016-10-28 五 13:39]

* phase II
** DONE 专心阅读戒烟书
   CLOSED: [2016-11-01 二 20:19]
   - CLOSING NOTE [2016-11-01 二 20:19]
** DONE 准备戒烟
   CLOSED: [2016-11-01 二 20:19]
   - CLOSING NOTE [2016-11-01 二 20:19]

* phase III
** no-smoker? non-smoking? smokerless?


* TODO keep daily punch from now on
   SCHEDULED: <2016-11-09 三 +1d>
   :PROPERTIES:
   :LAST_REPEAT: [2016-11-11 五 13:37]
   :END:
   - CLOSING NOTE [2016-11-11 五 13:37] \\
     120hrs on the way!
   - CLOSING NOTE [2016-11-10 四 10:40] \\
     72+24 =  96 hrs
     一点一点时间的积累还是很有成就感的．
     不过失眠厉害了，　５点多就醒了．　不敢喝茶，喝咖啡了．　
   - CLOSING NOTE [2016-11-09 三 14:13] \\
     这两天开始出现失眠，或者睡觉中断．
     很难入睡，　睡了几个小时就醒．　现在居然早上七点不到就能睁开双眼．

     觉得周围环境也比吸烟的时候更加吵闹．
   - CLOSING NOTE [2016-11-08 二 09:03] \\
     早上起来，空气清新，口气清晰，　非吸烟者第三天开始!
   - CLOSING NOTE [2016-11-07 一 22:24] \\
     持续３６个小时没有抽烟．　
     这次的经历有两个有意思的点，
     第一，　这本书可以让你戒烟里面隐含的潜意识的逻辑
     第二，　乐只这个ａｐｐ，在恰当的时候出现了，冥想本身也是意识层面的东西．　

     道理都有一定的相通性，　也很互补．　
   - CLOSING NOTE [2016-11-03 四 11:41] \\
     第三天，上午在之前早上起床的固定时间比较想抽烟．
     一上午工作繁忙，几乎没有想法
   - CLOSING NOTE [2016-11-01 二 20:21]
   - CLOSING NOTE [2016-11-01 二 20:20]
